# Data Science Academy

## Fundamentals of Python Language for Data Analyse and Data Science

### Manipulation of Data with Pandas

In [1]:
# Python Language version
from platform import python_version
print("Python Language version used in this Jupyter Notebook: ", python_version())

Python Language version used in this Jupyter Notebook:  3.11.5

### User Guide Pandas:

https://pandas.pydata.org/docs/user_guide/index.html

In [2]:
# Install the exact package version (if necessary)
!pip install -q pandas==1.5.3

In [3]:
import pandas as pd

In [4]:
pd.__version__

'2.0.3'

### Manipulating Data in DataFrames from Pandas

In [11]:
# Create a dictionary
data = {"State": ["Santa Catarina", "Rio de Janeiro", "Pernambuco", "Bahia", "Minas Gerais"], 
        "Year": [2004, 2005, 2006, 2007, 2008],
        "Employement Rate": [1.5, 1.7, 1.6, 2.4, 2.7]}

In [12]:
# Import the function DataFrame from Pandas
from pandas import DataFrame

In [13]:
# Convert the dicitonary in a dataframe
df = DataFrame(data)

In [14]:
# Visualize the first 5 lines
df.head()

            State  Year  Employement Rate
0  Santa Catarina  2004               1.5
1  Rio de Janeiro  2005               1.7
2      Pernambuco  2006               1.6
3           Bahia  2007               2.4
4    Minas Gerais  2008               2.7

In [15]:
type(df)

pandas.core.frame.DataFrame

In [17]:
# Reorganizing the columns
DataFrame(data, columns = ["State", "Employement Rate", "Year"])

            State  Employement Rate  Year
0  Santa Catarina               1.5  2004
1  Rio de Janeiro               1.7  2005
2      Pernambuco               1.6  2006
3           Bahia               2.4  2007
4    Minas Gerais               2.7  2008

In [18]:
df2 = DataFrame(data, columns=["State", "Employement Rate", "Grow Rate", "Year",],
               index = ["state1", "state2", "state3", "state4", "state5"])

In [19]:
df2

                 State  Employement Rate Grow Rate  Year
state1  Santa Catarina               1.5       NaN  2004
state2  Rio de Janeiro               1.7       NaN  2005
state3      Pernambuco               1.6       NaN  2006
state4           Bahia               2.4       NaN  2007
state5    Minas Gerais               2.7       NaN  2008

In [20]:
df2.columns

Index(['State', 'Employement Rate', 'Grow Rate', 'Year'], dtype='object')

In [21]:
# Printing only one column from the DataFrame
df2["State"]

state1    Santa Catarina
state2    Rio de Janeiro
state3        Pernambuco
state4             Bahia
state5      Minas Gerais
Name: State, dtype: object

In [24]:
# Printing only two columns from the DataFrame
df2[["Employement Rate", "Year"]]

        Employement Rate  Year
state1               1.5  2004
state2               1.7  2005
state3               1.6  2006
state4               2.4  2007
state5               2.7  2008

In [25]:
df2.index

Index(['state1', 'state2', 'state3', 'state4', 'state5'], dtype='object')

In [26]:
df2.values

array([['Santa Catarina', 1.5, nan, 2004],
       ['Rio de Janeiro', 1.7, nan, 2005],
       ['Pernambuco', 1.6, nan, 2006],
       ['Bahia', 2.4, nan, 2007],
       ['Minas Gerais', 2.7, nan, 2008]], dtype=object)

In [27]:
df2.dtypes

State                object
Employement Rate    float64
Grow Rate            object
Year                  int64
dtype: object

In [28]:
# Python Language is case sensitive
# df2["state"]

In [29]:
df2.filter(items = ["state3"], axis = 0)

             State  Employement Rate Grow Rate  Year
state3  Pernambuco               1.6       NaN  2006

### Using NumPy and Pandas for Data Manipulation

In [30]:
# Importing Numpy
import numpy as np

In [31]:
df2.isna()

        State  Employement Rate  Grow Rate   Year
state1  False             False       True  False
state2  False             False       True  False
state3  False             False       True  False
state4  False             False       True  False
state5  False             False       True  False

In [32]:
df2["Grow Rate"].isna()

state1    True
state2    True
state3    True
state4    True
state5    True
Name: Grow Rate, dtype: bool

In [9]:
# Loop
for item in vehicles_list:
    # the method accelerating has a different behavior deppending
    # the type of the object
    item.accelerating()
    
    # The same for the breaking method
    item.breaking()
    
    # Executing the method departing only if the object is a
    # instance of the Airplane class
    if isinstance(item, Airplane):
        item.departing()
    
    print("----------")

The car is accelerating!
The car is breaking!
----------
The motorcycle is accelerating!
The motorcycle is breaking!
----------
The airplane is accelerating!
The airplane is breaking!
The airplane is departing!
----------

## End
### Thank you!